In [2]:
import pandas as pd

# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

,Company,Person,Sales
0,GOOG,Sam,200
1,GOOG,Charlie,120
2,MSFT,Amy,340
3,MSFT,Vanessa,124
4,FB,Carl,243
5,FB,Sarah,350

In [6]:
byComp = df.groupby('Company')

In [8]:
byComp.mean()

,Sales
Company,
FB,296.5
GOOG,160.0
MSFT,232.0

In [9]:
byComp.sum()

,Sales
Company,
FB,593
GOOG,320
MSFT,464

In [10]:
byComp.std()

,Sales
Company,
FB,75.660426
GOOG,56.568542
MSFT,152.735065

In [11]:
byComp.sum().loc['FB']

In [12]:
df.groupby('Company').sum().loc['FB']

In [13]:
df.groupby('Company').max()

,Person,Sales
Company,,
FB,Sarah,350
GOOG,Sam,200
MSFT,Vanessa,340

In [14]:
df.groupby('Company').min()

,Person,Sales
Company,,
FB,Carl,243
GOOG,Charlie,120
MSFT,Amy,124

In [16]:
df.groupby('Company').describe()

In [18]:
df.groupby('Company').describe().transpose() # if you want it to by by column

In [19]:
df.groupby('Company').describe().transpose()['FB']